% Визначити матрицю T
T = [1 -1; -1 1; 1 1; -1 -1]';

% Побудувати точки рівноваги
plot(T(1, :), T(2, :), '*r') % Точки рівноваги
axis([-1.1 1.1 -1.1 1.1]);
title('Точки рівноваги проектованої мережі');
xlabel('a(1)'), ylabel('a(2)')

% Створити мережу Хопфілда
net = newhop(T);
W = net.LW{1, 1};
b = net.b{1, 1};

% Симулювати роботу мережі
Ai = T;
Y = sim(net, 4, [], Ai);

% Побудувати результати
plot(T(1, :), T(2, :), '*r'), hold on
axis([-1.1 1.1 -1.1 1.1])
xlabel('a(1)'), ylabel('a(2)')

% Створити ще одну мережу Хопфілда
newNet = newhop(T);

% Знову симулювати роботу мережі
[Y, Pf, Af] = sim(net, 4, [], T);

% Ітерувати та симулювати протягом 25 кроків
for i = 1:25
    % Згенерувати випадковий вхід
    a = {rands(2, 1)};
    
    % Симулювати роботу мережі
    [Y, Pf, Af] = sim(net, {1, 20}, {}, a);
    
    % Записати та побудувати результати
    record = [cell2mat(a), cell2mat(Y)];
    start = cell2mat(a);
    
    % Побудувати початкову точку та траєкторію
    plot(start(1, 1), start(2, 1), 'kx', record(1, :), record(2, :))
end
