% Створення стійких точок
T = [1 -1; -1 1; 1 1; -1 -1]';

% Візуалізація стійких точок
plot(T(1, :), T(2, :), '*r');
axis([-1.1 1.1 -1.1 1.1]);
title('Точки рівноваги проектуємої мережі');
xlabel('a(1)'), ylabel('a(2)');

% Створення мережі Хопфілда
net = newhop(T);
W = net.LW{1, 1};
b = net.b{1, 1};

% Моделювання динаміки мережі протягом 25 ітерацій
for i = 1:25
    a = {randn(2, 1)};
    [Y, ~, ~] = sim(net, {1, 20}, {}, a);
    record = [cell2mat(a), cell2mat(Y)];
    start = cell2mat(a);
    plot(start(1, 1), start(2, 1), 'kx', record(1, :), record(2, :));
    
    % Виведення результатів
    fprintf('Ітерація %d:\n', i);
    disp('Початкова точка:');
    disp(start);
    disp('Кінцева точка:');
    disp(record(:, end));
end
